
## Plan Result

[CI link](https://github.com/Digix00/hackathon/actions/runs/23369321585)


<pre><code>Plan: 3 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket.avatars
  * google_storage_bucket_iam_member.avatars_public_reader
  * google_storage_bucket_iam_member.cloudrun_avatar_writer
* Update
  * google_cloud_run_v2_service.api
  * google_cloud_run_v2_service.lyria_worker
  * google_cloud_run_v2_service.migrate
  * google_cloud_run_v2_service.seed_demo
  * google_cloud_run_v2_service.worker
  * google_identity_platform_config.auth


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
      - client                  = "gcloud" -> null
      - client_version          = "559.0.0" -> null
        id                      = "projects/musicswapping/locations/asia-northeast1/services/api"
        name                    = "api"
        # (31 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/musicswapping/app/server:4f19b1eaf248908ae8294f16a7cfa971181df2d6" -> "asia-northeast1-docker.pkg.dev/musicswapping/app/server:latest"
                name           = null
                # (6 unchanged attributes hidden)

              + env {
                  + name  = "AVATAR_BUCKET_NAME"
                  + value = "musicswapping-avatars"
                }

                # (17 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.lyria_worker will be updated in-place
  ~ resource "google_cloud_run_v2_service" "lyria_worker" {
        id                      = "projects/musicswapping/locations/asia-northeast1/services/lyria-worker"
        name                    = "lyria-worker"
        # (33 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/musicswapping/app/worker:287e683fda729fcf1ae3e823e1d490263a429d54" -> "asia-northeast1-docker.pkg.dev/musicswapping/app/worker:latest"
                name           = null
                # (6 unchanged attributes hidden)

                # (16 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.migrate will be updated in-place
  ~ resource "google_cloud_run_v2_service" "migrate" {
        id                      = "projects/musicswapping/locations/asia-northeast1/services/migrate"
        name                    = "migrate"
        # (33 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/musicswapping/app/migrate:d7b24d9dac25b9a1fbd9dc52cb4dacbec54890cd" -> "asia-northeast1-docker.pkg.dev/musicswapping/app/migrate:latest"
                name           = null
                # (6 unchanged attributes hidden)

                # (8 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.seed_demo will be updated in-place
  ~ resource "google_cloud_run_v2_service" "seed_demo" {
      - client                  = "gcloud" -> null
      - client_version          = "559.0.0" -> null
        id                      = "projects/musicswapping/locations/asia-northeast1/services/seed-demo"
        name                    = "seed-demo"
        # (31 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/musicswapping/app/seed-demo:4f19b1eaf248908ae8294f16a7cfa971181df2d6" -> "asia-northeast1-docker.pkg.dev/musicswapping/app/seed-demo:latest"
                name           = null
                # (6 unchanged attributes hidden)

                # (11 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.worker will be updated in-place
  ~ resource "google_cloud_run_v2_service" "worker" {
      - client                  = "gcloud" -> null
      - client_version          = "559.0.0" -> null
        id                      = "projects/musicswapping/locations/asia-northeast1/services/worker"
        name                    = "worker"
        # (31 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/musicswapping/app/worker:4f19b1eaf248908ae8294f16a7cfa971181df2d6" -> "asia-northeast1-docker.pkg.dev/musicswapping/app/worker:latest"
                name           = null
                # (6 unchanged attributes hidden)

                # (9 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_identity_platform_config.auth will be updated in-place
  ~ resource "google_identity_platform_config" "auth" {
        id                         = "projects/musicswapping/config"
        name                       = "projects/599474430997/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ sign_in {
            # (2 unchanged attributes hidden)

          - phone_number {
              - enabled            = false -> null
              - test_phone_numbers = {} -> null
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_storage_bucket.avatars will be created
  + resource "google_storage_bucket" "avatars" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "musicswapping-avatars"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_iam_member.avatars_public_reader will be created
  + resource "google_storage_bucket_iam_member" "avatars_public_reader" {
      + bucket = "musicswapping-avatars"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.cloudrun_avatar_writer will be created
  + resource "google_storage_bucket_iam_member" "cloudrun_avatar_writer" {
      + bucket = "musicswapping-avatars"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:cloudrun-sa@musicswapping.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

Plan: 3 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":247,"Program":"tfcmt","SHA1":"bf206cfa26faca357f72072c68c97b3b8063232c","Vars":{},"WorkflowName":"terraform-plan"} -->